## More on Data Frames:

In [58]:
import numpy as np
import pandas as pd

### Creating a Random Data:

In [59]:
random_data = np.random.randint(1,101,size=(3,5))  # r,c
random_data
# Creating a random data with 3 rows and 5 columns with values between 1 to 100.

array([[ 8, 62, 39, 91,  7],
       [24, 10,  6, 25, 62],
       [21, 55, 26, 58, 18]])

### Converting Random data to Data Frame:

In [60]:
row_labels = ["Morning","Afternoon","Evening"]

In [61]:
column_labels = ["Monday","Tuesday","Wednesday","Thursday","Friday"]

In [62]:
df = pd.DataFrame(data=random_data, index = row_labels, columns= column_labels)

In [63]:
df

           Monday  Tuesday  Wednesday  Thursday  Friday
Morning         8       62         39        91       7
Afternoon      24       10          6        25      62
Evening        21       55         26        58      18

### Transposing the Data frame:

In [64]:
df.T   # .T is used to Transpose the Data frame

           Morning  Afternoon  Evening
Monday           8         24       21
Tuesday         62         10       55
Wednesday       39          6       26
Thursday        91         25       58
Friday           7         62       18

In [65]:
df.transpose()  # Another way to Transpose the Data frame

           Morning  Afternoon  Evening
Monday           8         24       21
Tuesday         62         10       55
Wednesday       39          6       26
Thursday        91         25       58
Friday           7         62       18

### Switching to nba dataset:

In [66]:
nba = pd.read_csv("data/nba.csv", parse_dates=["Birthday"], index_col = "Name")

/var/folders/68/pk2ryt213gq2t0y7rqv8f9_h0000gn/T/ipykernel_60330/2072130384.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  nba = pd.read_csv("data/nba.csv", parse_dates=["Birthday"], index_col = "Name")

In [67]:
nba.head(5)

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       SG 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
PJ Washington    Charlotte Hornets       PF 1998-08-23  3831840
Derrick Rose       Detroit Pistons       PG 1988-10-04  7317074
Marial Shayok   Philadelphia 76ers        G 1995-07-26    79568

In [68]:
nba.dtypes.value_counts()

object            2
datetime64[ns]    1
int64             1
Name: count, dtype: int64

### To check Max and Min of Data Frame:

In [69]:
nba.max()

Team         Washington Wizards
Position                     SG
Birthday    2000-12-23 00:00:00
Salary                 40231758
dtype: object

In [70]:
nba.nlargest(n=3,columns = "Salary")

                                    Team Position   Birthday    Salary
Name
Stephen Curry      Golden State Warriors       PG 1988-03-14  40231758
Chris Paul         Oklahoma City Thunder       PG 1985-05-06  38506482
Russell Westbrook        Houston Rockets       PG 1988-11-12  38506482

In [71]:
nba.nsmallest(n=3, columns = "Salary")

                                 Team Position   Birthday  Salary
Name
Marial Shayok      Philadelphia 76ers        G 1995-07-26   79568
Norvel Pelle       Philadelphia 76ers       FC 1993-02-03   79568
Jaylen Hoard   Portland Trail Blazers       SF 1999-03-30   79568

### To find Mean, Median, Mode, standard deviation, min, max from column "Salary" :

In [72]:
nba.sum(numeric_only=True)  # mean(), median(), std(), min(), max(), mode()

Salary    3444112694
dtype: int64

In [73]:
nba.mean(numeric_only=True) #mean

Salary    7.653584e+06
dtype: float64

In [74]:
nba.median(numeric_only=True) #median

Salary    3303074.5
dtype: float64

In [75]:
nba.std(numeric_only=True) #standard deviation

Salary    9.288810e+06
dtype: float64

In [76]:
nba.min(numeric_only=True) #min

Salary    79568
dtype: int64

In [77]:
nba.max(numeric_only=True) #max

Salary    40231758
dtype: int64

### Sorting by Index:
- axis = 0 : is for sorting Rows.
- axis = 1 : is for sorting Columns.

In [78]:
nba.sort_index()  # ascending by default A-Z

                                    Team Position   Birthday    Salary
Name
Aaron Gordon               Orlando Magic       PF 1995-09-16  19863636
Aaron Holiday             Indiana Pacers       PG 1996-09-30   2239200
Abdel Nader        Oklahoma City Thunder       SF 1993-09-25   1618520
Adam Mokoka                Chicago Bulls        G 1998-07-18     79568
Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
...                                  ...      ...        ...       ...
Zach LaVine                Chicago Bulls       PG 1995-03-10  19500000
Zach Norvell          Los Angeles Lakers       SG 1997-12-09     79568
Zhaire Smith          Philadelphia 76ers       SG 1999-06-04   3058800
Zion Williamson     New Orleans Pelicans        F 2000-07-06   9757440
Zylan Cheatham      New Orleans Pelicans       SF 1995-11-17     79568

[450 rows x 4 columns]

In [79]:
nba.sort_index(axis=1, ascending = False)  #axis=1 or axis = "columns" for sorting columns

                               Team    Salary Position   Birthday
Name
Shake Milton     Philadelphia 76ers   1445697       SG 1996-09-26
Christian Wood      Detroit Pistons   1645357       PF 1995-09-27
PJ Washington     Charlotte Hornets   3831840       PF 1998-08-23
Derrick Rose        Detroit Pistons   7317074       PG 1988-10-04
Marial Shayok    Philadelphia 76ers     79568        G 1995-07-26
...                             ...       ...      ...        ...
Austin Rivers       Houston Rockets   2174310       PG 1992-08-01
Harry Giles        Sacramento Kings   2578800       PF 1998-04-22
Robin Lopez         Milwaukee Bucks   4767000        C 1988-04-01
Collin Sexton   Cleveland Cavaliers   4764960       PG 1999-01-04
Ricky Rubio            Phoenix Suns  16200000       PG 1990-10-21

[450 rows x 4 columns]

### Select the rows and columns from a Data Frame:

In [80]:
nba  # here the name is index column

                               Team Position   Birthday    Salary
Name
Shake Milton     Philadelphia 76ers       SG 1996-09-26   1445697
Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
PJ Washington     Charlotte Hornets       PF 1998-08-23   3831840
Derrick Rose        Detroit Pistons       PG 1988-10-04   7317074
Marial Shayok    Philadelphia 76ers        G 1995-07-26     79568
...                             ...      ...        ...       ...
Austin Rivers       Houston Rockets       PG 1992-08-01   2174310
Harry Giles        Sacramento Kings       PF 1998-04-22   2578800
Robin Lopez         Milwaukee Bucks        C 1988-04-01   4767000
Collin Sexton   Cleveland Cavaliers       PG 1999-01-04   4764960
Ricky Rubio            Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 4 columns]

In [81]:
nba = nba.reset_index()
nba
# reset the index to its orginal.

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

### Select_dtypes:

In [82]:
nba.select_dtypes(include = "object")

               Name                 Team Position
0      Shake Milton   Philadelphia 76ers       SG
1    Christian Wood      Detroit Pistons       PF
2     PJ Washington    Charlotte Hornets       PF
3      Derrick Rose      Detroit Pistons       PG
4     Marial Shayok   Philadelphia 76ers        G
..              ...                  ...      ...
445   Austin Rivers      Houston Rockets       PG
446     Harry Giles     Sacramento Kings       PF
447     Robin Lopez      Milwaukee Bucks        C
448   Collin Sexton  Cleveland Cavaliers       PG
449     Ricky Rubio         Phoenix Suns       PG

[450 rows x 3 columns]

In [83]:
nba.select_dtypes(exclude = "int")

               Name                 Team Position   Birthday
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26
1    Christian Wood      Detroit Pistons       PF 1995-09-27
2     PJ Washington    Charlotte Hornets       PF 1998-08-23
3      Derrick Rose      Detroit Pistons       PG 1988-10-04
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26
..              ...                  ...      ...        ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01
446     Harry Giles     Sacramento Kings       PF 1998-04-22
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21

[450 rows x 4 columns]

In [84]:
nba.select_dtypes(exclude= ["object","int"])

      Birthday
0   1996-09-26
1   1995-09-27
2   1998-08-23
3   1988-10-04
4   1995-07-26
..         ...
445 1992-08-01
446 1998-04-22
447 1988-04-01
448 1999-01-04
449 1990-10-21

[450 rows x 1 columns]

In [85]:
nba = nba.set_index("Name")
nba

                               Team Position   Birthday    Salary
Name
Shake Milton     Philadelphia 76ers       SG 1996-09-26   1445697
Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
PJ Washington     Charlotte Hornets       PF 1998-08-23   3831840
Derrick Rose        Detroit Pistons       PG 1988-10-04   7317074
Marial Shayok    Philadelphia 76ers        G 1995-07-26     79568
...                             ...      ...        ...       ...
Austin Rivers       Houston Rockets       PG 1992-08-01   2174310
Harry Giles        Sacramento Kings       PF 1998-04-22   2578800
Robin Lopez         Milwaukee Bucks        C 1988-04-01   4767000
Collin Sexton   Cleveland Cavaliers       PG 1999-01-04   4764960
Ricky Rubio            Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 4 columns]

In [86]:
nba.loc["Derrick Rose",["Team","Salary"]]

Team      Detroit Pistons
Salary            7317074
Name: Derrick Rose, dtype: object

In [87]:
nba.loc[["Ricky Rubio", "Derrick Rose"], ["Team","Salary"]]

                         Team    Salary
Name
Ricky Rubio      Phoenix Suns  16200000
Derrick Rose  Detroit Pistons   7317074

### using range of Presons in Name column, to check needed data:

In [88]:
nba.loc["Christian Wood" : "Marial Shayok", ["Team", "Salary"] ]

                              Team   Salary
Name
Christian Wood     Detroit Pistons  1645357
PJ Washington    Charlotte Hornets  3831840
Derrick Rose       Detroit Pistons  7317074
Marial Shayok   Philadelphia 76ers    79568

### using Index number aswell:

In [89]:
nba.iloc[1,2]  
#here 1 is row index, and 2 is column index.
# so this is the data of Christian wood (1st index in Row) with Birthday (2nd Index in Column)

Timestamp('1995-09-27 00:00:00')

In [90]:
nba.sort_index()  # by default Ascending Order

                                    Team Position   Birthday    Salary
Name
Aaron Gordon               Orlando Magic       PF 1995-09-16  19863636
Aaron Holiday             Indiana Pacers       PG 1996-09-30   2239200
Abdel Nader        Oklahoma City Thunder       SF 1993-09-25   1618520
Adam Mokoka                Chicago Bulls        G 1998-07-18     79568
Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
...                                  ...      ...        ...       ...
Zach LaVine                Chicago Bulls       PG 1995-03-10  19500000
Zach Norvell          Los Angeles Lakers       SG 1997-12-09     79568
Zhaire Smith          Philadelphia 76ers       SG 1999-06-04   3058800
Zion Williamson     New Orleans Pelicans        F 2000-07-06   9757440
Zylan Cheatham      New Orleans Pelicans       SF 1995-11-17     79568

[450 rows x 4 columns]

In [91]:
nba = nba.reset_index()
nba

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

In [92]:
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

### Changing the Names of Columns:

In [93]:
nba.columns = ["Name", "Team", "Position", "Day of Birth", "Pay"]

In [94]:
nba

               Name                 Team Position Day of Birth       Pay
0      Shake Milton   Philadelphia 76ers       SG   1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF   1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF   1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG   1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G   1995-07-26     79568
..              ...                  ...      ...          ...       ...
445   Austin Rivers      Houston Rockets       PG   1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF   1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C   1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG   1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG   1990-10-21  16200000

[450 rows x 5 columns]

In [95]:
nba = nba.rename(columns= {"Day of Birth": "Birthday"})
nba

               Name                 Team Position   Birthday       Pay
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

### changing the name of Index.

In [96]:
nba = nba.set_index("Name")
nba

                               Team Position   Birthday       Pay
Name
Shake Milton     Philadelphia 76ers       SG 1996-09-26   1445697
Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
PJ Washington     Charlotte Hornets       PF 1998-08-23   3831840
Derrick Rose        Detroit Pistons       PG 1988-10-04   7317074
Marial Shayok    Philadelphia 76ers        G 1995-07-26     79568
...                             ...      ...        ...       ...
Austin Rivers       Houston Rockets       PG 1992-08-01   2174310
Harry Giles        Sacramento Kings       PF 1998-04-22   2578800
Robin Lopez         Milwaukee Bucks        C 1988-04-01   4767000
Collin Sexton   Cleveland Cavaliers       PG 1999-01-04   4764960
Ricky Rubio            Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 4 columns]

In [97]:
nba.rename(index = {"PJ Washington" : "DJ Washington"})

# PJ washington in Index renamed to DJ washington
# its just temporary change, we did not assigned it to DF/

                               Team Position   Birthday       Pay
Name
Shake Milton     Philadelphia 76ers       SG 1996-09-26   1445697
Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
DJ Washington     Charlotte Hornets       PF 1998-08-23   3831840
Derrick Rose        Detroit Pistons       PG 1988-10-04   7317074
Marial Shayok    Philadelphia 76ers        G 1995-07-26     79568
...                             ...      ...        ...       ...
Austin Rivers       Houston Rockets       PG 1992-08-01   2174310
Harry Giles        Sacramento Kings       PF 1998-04-22   2578800
Robin Lopez         Milwaukee Bucks        C 1988-04-01   4767000
Collin Sexton   Cleveland Cavaliers       PG 1999-01-04   4764960
Ricky Rubio            Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 4 columns]

In [99]:
nba

                               Team Position   Birthday       Pay
Name
Shake Milton     Philadelphia 76ers       SG 1996-09-26   1445697
Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
PJ Washington     Charlotte Hornets       PF 1998-08-23   3831840
Derrick Rose        Detroit Pistons       PG 1988-10-04   7317074
Marial Shayok    Philadelphia 76ers        G 1995-07-26     79568
...                             ...      ...        ...       ...
Austin Rivers       Houston Rockets       PG 1992-08-01   2174310
Harry Giles        Sacramento Kings       PF 1998-04-22   2578800
Robin Lopez         Milwaukee Bucks        C 1988-04-01   4767000
Collin Sexton   Cleveland Cavaliers       PG 1999-01-04   4764960
Ricky Rubio            Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 4 columns]